Renova/src/Documents/ОтчетОПродажахИПроизводстве/ОтчетОПродажахИПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПродажахИПроизводстве</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Производство</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидДокументаПродажиИПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокВидовПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ВидыПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцУчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/Enums/ВидДокументаПродажиИПроизводство/ВидДокументаПродажиИПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаПродажиИПроизводство</name>
  <enumValues>
    <name>Продажи</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Documents/ОтчетОПродажахИПроизводстве/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	
	ТекущийОбъект.Товары.Очистить();
	
	// Переписываем данные из ТаблицыФорма в реквизит Документа
	КолонкиТаблицы = ТаблицаФормы.Выгрузить().Колонки;
    Префикс = ПолучитьПрефиксРеквизита();
    Для Каждого СтрокаДанных Из ТаблицаФормы Цикл
    	Если Не ЗначениеЗаполнено(СтрокаДанных.Модель) Тогда
    		Продолжить;
    	КонецЕсли;
        Для Каждого Колонка Из КолонкиТаблицы Цикл
            ИмяКолонки = Колонка.Имя;
            Значение   = СтрокаДанных[ИмяКолонки];
            Если СтрНачинаетсяС(ИмяКолонки, Префикс) Тогда
            	Инд = СтрНайти(ИмяКолонки, "_");
            	Если Инд > 0 Тогда
            		НоваяСтрока = ТекущийОбъект.Товары.Добавить();
    				НоваяСтрока.Номенклатура = СтрокаДанных.Модель;
    				НоваяСтрока.ВидПродукции = СтрокаДанных.ВидПродукции;
                	МесяцСтрока = Сред(ИмяКолонки, Инд + 1);
                	НоваяСтрока.МесяцУчета = Дата(МесяцСтрока);
                	НоваяСтрока.Количество = Число(Значение);
                КонецЕсли;
            КонецЕсли;      
        КонецЦикла;    
    КонецЦикла;
   	ТекущийОбъект.Товары.Свернуть("Номенклатура,МесяцУчета,ВидПродукции", "Количество");
	
	Если ТекущийОбъект.Товары.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю; 
		Сообщение.Текст = "Список товаров пуст!";
		Сообщение.Поле = "ТаблицаФормы";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();     
		Отказ = Истина;
	КонецЕсли;
   	   
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Создаем структуру таблицы
	ИзменитьТабличнуюЧасть();
	
	// Получаем соответствие дат начала месяца и имен колонок
	СоответствиеДатИКолонок = ПолучитьСоответствиеДатИКолонок();
	
	// Загружаем данные из реквизита Документа в ТаблицуФормы
	Для Каждого Товар Из ТекущийОбъект.Товары Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Модель", Товар.Номенклатура);
		МассивСтрок = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТаблицыФормы = ТаблицаФормы.Добавить();
			СтрокаТаблицыФормы.Модель = Товар.Номенклатура;
			СтрокаТаблицыФормы.ВидПродукции = Товар.ВидПродукции;
		Иначе
			СтрокаТаблицыФормы = МассивСтрок[0];		
		КонецЕсли;
		// Ищем колонку в соответствии
		ИмяКолонки = СоответствиеДатИКолонок.Получить(Товар.МесяцУчета);
		Если ИмяКолонки <> Неопределено Тогда
			СтрокаТаблицыФормы[ИмяКолонки] = Товар.Количество;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСтроковыеЗначенияПериода();
	УстановитьЗаголовокФормы();
	ЭтоПродажи = (Объект.ВидДокумента = ПредопределенноеЗначение(
		"Перечисление.ВидДокументаПродажиИПроизводство.Продажи"));
	Элементы.Фабрика.Видимость = Не ЭтоПродажи;
	Элементы.Фирма.Видимость = ЭтоПродажи;
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидДокумента")Тогда
		Объект.ВидДокумента = Параметры.ВидДокумента;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьЗаголовокФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораМесяца(Объект.НачалоПериода, "Начало периода",
		"ПослеВыбораНачалоПериода");
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораМесяца(Объект.КонецПериода, "Конец периода",
		"ПослеВыбораКонецПериода");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФормы

&НаКлиенте
Процедура ТаблицаФормыМодельПриИзменении(Элемент)
	ТекущаяСтрокаДанных = Элементы.ТаблицаФормы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрокаДанных.Модель) Тогда
		ТекущаяСтрокаДанных.ВидПродукции = ПолучитьВидПродукции(ТекущаяСтрокаДанных.Модель);
	Иначе
		ТекущаяСтрокаДанных.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте Асинх
Процедура ЗагрузитьДанные(Команда) 

	ИмяФайла = Ждать РаботаСФайломКлиент.ВыбратьФайлTXT(); 
	ПутьКФайлу = ИмяФайла.ПутьКФайлу; 
	ПрочитатьФайлПродаж(ПутьКФайлу);  
	ТаблицаФормы.Сортировать("ВидПродукции,Модель");
	// Выбираем первую строку
    Если ТаблицаФормы.Количество() > 0 Тогда
        ПерваяСтрока = ТаблицаФормы[0].ПолучитьИдентификатор();
        Элементы.ТаблицаФормы.ТекущаяСтрока = ПерваяСтрока;        
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	Если Объект.ВидДокумента = ПредопределенноеЗначение(
		"Перечисление.ВидДокументаПродажиИПроизводство.Продажи") Тогда
			ИмяВида = "Отчет о Продажах";
	Иначе
			ИмяВида = "Отчет о Производстве";		
	КонецЕсли;	
	Если Объект.Ссылка.Пустая() Тогда
		 Заголовок = СтрШаблон("%1 (создание)", ИмяВида)
	Иначе
		Заголовок = СтрШаблон("%1 %2 от %3", ИмяВида, Объект.Номер, Объект.Дата);
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьФормуВыбораМесяца(НачальнаяДата, ЗаголовокФормы, ИмяМетода)
	Оповещение = Новый ОписаниеОповещения(ИмяМетода, ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачальнаяДата", НачальнаяДата);
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораМесяца", ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор, , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПрефиксРеквизита()
	Возврат "tmp";
КонецФункции

&НаСервере
Процедура ИзменитьТабличнуюЧасть()
	Если Объект.КонецПериода < Объект.НачалоПериода Тогда
		ВызватьИсключение "Конец периода меньше начала периода!";
	КонецЕсли;
	
	// Удаляем ранее добавленные элементы и реквизиты по префиксу
	УдалитьПрограммноДобавленыеЭлементыИРеквизиты();
	
	// Подготавливаем списко добавляемых колонок
	КоличествоКолонок = (Месяц(Объект.КонецПериода) - Месяц(Объект.НачалоПериода))	
		+ (Год(Объект.КонецПериода) - Год(Объект.НачалоПериода)) * 12 + 1;
	СписокКолонок = Новый Массив;
	ТекМесяц = НачалоМесяца(Объект.НачалоПериода);
	Префикс = ПолучитьПрефиксРеквизита();
	Для Сч = 1 По КоличествоКолонок Цикл
		НоваяКолонка = Новый Структура();
		ИмяКолонки = СтрШаблон("%1%2_%3", Префикс, НумераторРеквизитов, Формат(ТекМесяц, "ДФ=yyyyMMdd;"));
		НоваяКолонка.Вставить("Имя", ИмяКолонки);
		НоваяКолонка.Вставить("Заголовок", Формат(ТекМесяц, "ДФ='MMMM yyyy';"));
		СписокКолонок.Добавить(НоваяКолонка);	
		ТекМесяц = НачалоМесяца(ДобавитьМесяц(ТекМесяц, 1));
	КонецЦикла;
	
	// Добавляем реквизиты формы	
	ДобавляемыеРеквизиты = Новый Массив;
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный);
    ОписаниеТипаКолонки = Новый ОписаниеТипов("Число",  КвалификаторыЧисла);
	Для Каждого НоваяКолонка Из СписокКолонок Цикл
		НовыйРеквизит = Новый РеквизитФормы(НоваяКолонка.Имя, ОписаниеТипаКолонки,
			"ТаблицаФормы", НоваяКолонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем элементы формы
	Для Каждого НоваяКолонка Из СписокКолонок Цикл
		ЭлементКолонка = Элементы.Добавить(НоваяКолонка.Имя, Тип("ПолеФормы"),
			Элементы["ТаблицаФормы"]);
		ЭлементКолонка.Заголовок = НоваяКолонка.Заголовок;
    	ЭлементКолонка.ПутьКДанным = "ТаблицаФормы." + НоваяКолонка.Имя;
    	ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
	// Добавляем пустую колонку в конце для красоты таблицы
	ДобавитьПустоеПолеВТабличнуюЧасть();
	
	// Увеличиваем позицию нумератора
	НумераторРеквизитов = НумераторРеквизитов  + 1;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПустоеПолеВТабличнуюЧасть()
	// Добавляем реквизит формы	
	ИмяКолонки = СтрШаблон("%1%2%3", ПолучитьПрефиксРеквизита(), НумераторРеквизитов, "decoration");
	ДобавляемыеРеквизиты = Новый Массив;
    ОписаниеТипаКолонки = Новый ОписаниеТипов("Строка",  Новый КвалификаторыСтроки(10));
	НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ОписаниеТипаКолонки,
		"ТаблицаФормы");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем элементы формы
	ЭлементКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"),
		Элементы["ТаблицаФормы"]);
	ЭлементКолонка.Заголовок = Символ(32);
	ЭлементКолонка.ТолькоПросмотр = Истина;
    ЭлементКолонка.ПутьКДанным = "ТаблицаФормы." + ИмяКолонки;
    ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПрограммноДобавленыеЭлементыИРеквизиты()
	Префикс = ПолучитьПрефиксРеквизита();
	
	// Удаляем элементы Формы	
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И СтрНачинаетсяС(ЭлементФормы.Имя, Префикс) Тогда
			УдаляемыеЭлементы.Добавить(ЭлементФормы);
		КонецЕсли
	КонецЦикла;
	Для Каждого ЭлементФормы Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(ЭлементФормы);
	КонецЦикла;
	
	// Удаляем реквизиты
	РеквизитыФормы = ПолучитьРеквизиты();
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого РевизитФормы Из РеквизитыФормы Цикл
		Если СтрНачинаетсяС(РевизитФормы.Имя, Префикс) Тогда
			УдаляемыеРеквизиты.Добавить(РевизитФормы);
		КонецЕсли
	КонецЦикла;
	Если УдаляемыеРеквизиты.Количество() > 0 Тогда
        ИзменитьРеквизиты( , УдаляемыеРеквизиты);
    КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидПродукции(МодельСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Справочник.МоделиПродукции КАК МоделиПродукции
		|ГДЕ
		|	Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", МодельСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    Возврат Выборка.ВидПродукции;
	КонецЕсли;
	
	Возврат Справочники.ВидыПродукции.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеДатИКолонок()
	КолонкиТаблицы = ТаблицаФормы.Выгрузить().Колонки;	
	СоответствиеДат = Новый Соответствие;
	
	МесяцТек = Объект.НачалоПериода;
	Пока МесяцТек <= Объект.КонецПериода Цикл
		МесяцСтрока = Формат(МесяцТек, "ДФ=yyyyMMdd;");
		Для Каждого Колонка Из КолонкиТаблицы Цикл
            ИмяКолонки = Колонка.Имя;
            Если СтрНайти(ИмяКолонки,МесяцСтрока) > 0 Тогда
            	СоответствиеДат.Вставить(МесяцТек, ИмяКолонки);	
            КонецЕсли;      
		КонецЦикла;	
		МесяцТек = ДобавитьМесяц(МесяцТек, 1);
	КонецЦикла;
	
	Возврат СоответствиеДат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораНачалоПериода(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.НачалоПериода = Результат;
		Если Объект.НачалоПериода > Объект.КонецПериода Тогда
			Объект.КонецПериода = Объект.НачалоПериода;
		КонецЕсли;
		УстановитьСтроковыеЗначенияПериода();
		ИзменитьТабличнуюЧасть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонецПериода(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.КонецПериода = Результат;
		Если Объект.КонецПериода < Объект.НачалоПериода Тогда
			Объект.НачалоПериода = Объект.КонецПериода;
		КонецЕсли;
		УстановитьСтроковыеЗначенияПериода();
		ИзменитьТабличнуюЧасть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСтроковыеЗначенияПериода()
	НачалоПериодаСтрока = Формат(Объект.НачалоПериода, "ДФ='MMMM yyyy';");
	КонецПериодаСтрока = Формат(Объект.КонецПериода, "ДФ='MMMM yyyy';");
КонецПроцедуры
	
&НаСервере
Процедура ПрочитатьФайлПродаж(ПутьФайла, Кодировка = Неопределено) 
	
	Попытка
		// 1. Читаем файл через общий модуль
		Данные = РаботаСФайломСервер.ПрочитатьДанныеИзФайла(ПутьФайла, КодировкаТекста.ANSI);
		
		ЭтоПродажи = (Объект.ВидДокумента = Перечисления.ВидДокументаПродажиИПроизводство.Продажи);
		// Получаем вид документа
		Документ = Данные.Документ;
		ОшибкаЗаголовка = (ЭтоПродажи И Документ <> "Продажи")
			ИЛИ (Не ЭтоПродажи И Документ <> "Производство");
		Если ОшибкаЗаголовка Тогда
			Сообщить("Загружен не верный документ");
			Возврат;
		КонецЕсли;	
		
		// 2. Получаем ссылку на фирму/фабрику
		ФирмаИФабрика = СоответсвияСервер.ПолучитьФирмуИФабрику(Данные.ФирмаКод);
		Если ФирмаИФабрика = Неопределено Тогда
			Сообщить("Фирма '" + Данные.Фирма + "' не найдена в справочнике");
		Иначе
			Если ЭтоПродажи Тогда
				Объект.Фирма = ФирмаИФабрика.Фирма;
			Иначе
				Объект.Фабрика = ФирмаИФабрика.Фабрика;	
			КонецЕсли;		
		КонецЕсли;
			
		// 3. Заполняем реквизиты объекта
		Объект.НачалоПериода = Данные.НачалоПериода;
		Объект.КонецПериода = Данные.КонецПериода;
		
		// 4. Обновляем элементы формы (заголовки, создаём колонки таблицы)
		УстановитьСтроковыеЗначенияПериода();   
		ИзменитьТабличнуюЧасть(); 
		
		// 5. Получаем соответствие дат и имён колонок (уже на форме после ИзменитьТабличнуюЧасть)
		СоответствиеДатКолонок = ПолучитьСоответствиеДатИКолонок();
		
		// 6. Получаем модели по кодам из файла
		МассивКодов = Новый Массив;
		Для Каждого Ключ из Данные.ДанныеПоКодам Цикл 
			МассивКодов.Добавить(Ключ.Ключ);
		КонецЦикла;
		
		СоответствиеКодМодель = СоответсвияСервер.ПолучитьМоделиПоКодам(МассивКодов);
		
		// 7. Заполняем табличную часть формы
		ТаблицаФормы.Очистить();
		Для каждого Элемент Из Данные.ДанныеПоКодам Цикл
			Код = Элемент.Ключ;
			Количества = Элемент.Значение;
			ДанныеМодели = СоответствиеКодМодель.Получить(Код);
			Если ДанныеМодели = Неопределено Тогда
				Сообщить("Не найдена модель с кодом " + Код);
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаФормы.Добавить();
			НоваяСтрока.Модель = ДанныеМодели.Ссылка;
			НоваяСтрока.ВидПродукции = ДанныеМодели.ВидПродукции;
			
			Для Индекс = 0 По Данные.МассивДат.ВГраница() Цикл
				ИмяКолонки = СоответствиеДатКолонок.Получить(Данные.МассивДат[Индекс]);
				Если ИмяКолонки <> Неопределено И Индекс < Количества.Количество() Тогда
					НоваяСтрока[ИмяКолонки] = Количества[Индекс];
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Сообщить("Загрузка завершена. Добавлено строк: " + ТаблицаФормы.Количество());
		
	Исключение
		Сообщить("Ошибка при загрузке файла: " + ОписаниеОшибки());
	КонецПопытки;	

КонецПроцедуры

#КонецОбласти
